/*

  < 바코바코바코바 >

  숫자가 인자로 주어졌을 때, 다음과 같은 조건을 만족하는 함수를 작성해 주세요!

  📌 n이 1인 경우 문자열 "바"를 반환해야 합니다.
  📌 n이 2인 경우 문자열 "바코"를 반환해야 합니다.
  📌 n이 3인 경우 문자열 "바코바"를 반환해야 합니다.
  📌 그 이상의 숫자는 아래 예시를 참고해 주세요.
  📌 repeat 메서드를 사용하면 안됩니다.
  📌 n은 항상 1이상 입니다.

  
  +--------------------------------------------------------------------+
  |                 n                    |            리턴 값            |
  +--------------------------------------------------------------------+ 
  |                 1                    |             "바"             |
  +--------------------------------------------------------------------+
  |                 2                    |            "바코"            |
  +--------------------------------------------------------------------+ 
  |                 3                    |           "바코바"            |
  +--------------------------------------------------------------------+
  |                 5                    |          "바코바코바"          |
  +--------------------------------------------------------------------+                    
  |                 7                    |         "바코바코바코바"        |
  +--------------------------------------------------------------------+
  |                12                    |      "바코바코바코바코바코바코"    |
  +--------------------------------------------------------------------+
 
*/

function repeatVaco(n) {
  let result = '';
  for (let i = 1; i <= n; i++) {
    if (i % 2 === 0) {
      result += '코';
    } else {
      result += '바';
    }
  }
  return result;
}

const result1 = repeatVaco(1) === '바';
const result2 = repeatVaco(2) === '바코';
const result3 = repeatVaco(4) === '바코바코';
const result4 = repeatVaco(5) === '바코바코바';
const result5 = repeatVaco(10) === '바코바코바코바코바코';

if (result1 && result2 && result3 && result4 && result5) {
  alert('🎉');
}
